src/main/resources/static/getAgencies.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:art="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <art:getAllAgenciesRequest/>
    </soapenv:Body>
</soapenv:Envelope>